---
kind: type
id: T:Autodesk.Revit.DB.Macros.VendorIdAttribute
source: html/789e2e36-a560-cbf4-ed62-186d78ba4d51.htm
---
# Autodesk.Revit.DB.Macros.VendorIdAttribute

The custom VendorId attribute for Macros macros use only.

## Syntax (C#)
```csharp
public class VendorIdAttribute : Attribute
```